case_up_half_cube_01_800_wave/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

".*"
{
    transport
    {
        As 1.512e-06;
        Ts 120.;
    }
}

"H2"
{
    transport
    {
        As 6.362e-07;
        Ts 72.;
    }
}

"O2"
{
    transport
    {
        As 1.512e-06;
        Ts 120.;
    }
}

"N2"
{
    transport
    {
        As 1.512e-06;
        Ts 120.;
    }
}

"H2O"
{
    transport
    {
        As 1.512e-06;
        Ts 120.;
    }
}

"CO2"
{
    transport
    {
        As 1.572e-06;
        Ts 240.;
    }
}
