case_up_half_cube_01_800_wave/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }

    // Open faces: totalPressure anchors stagnation pressure at atmospheric.
    // Paired with pressureInletOutletVelocity on U.
    right
    {
        type            totalPressure;
        p0              uniform 101325;
        value           uniform 101325;
    }

    top
    {
        type            totalPressure;
        p0              uniform 101325;
        value           uniform 101325;
    }

    bottom
    {
        type            totalPressure;
        p0              uniform 101325;
        value           uniform 101325;
    }

    front
    {
        type            totalPressure;
        p0              uniform 101325;
        value           uniform 101325;
    }

    back
    {
        type            totalPressure;
        p0              uniform 101325;
        value           uniform 101325;
    }

    walls
    {
        type            zeroGradient;
    }

    // Fixed static pressure prevents expansion fan at nozzle exit
    // from pulling p below atmospheric and driving T < JANAF Tlow (200 K).
    source
    {
        type            fixedValue;
        value           uniform 101325;
    }

    nozzle_wall_rest
    {
        type            zeroGradient;
    }
}
