case_up_half_cube_01_800_wave/0.orig/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      N2;
}

dimensions      [0 0 0 0 0 0 0];

// N2 is the inertSpecie; its mass fraction = 1 - H2 - O2 - H2O
// Initial room atmosphere: Y_N2 = 1 - 0.233 = 0.767
internalField   uniform 0.767;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }

    right
    {
        type            inletOutlet;
        inletValue      uniform 0.767;
        value           uniform 0.767;
    }

    top
    {
        type            inletOutlet;
        inletValue      uniform 0.767;
        value           uniform 0.767;
    }

    bottom
    {
        type            inletOutlet;
        inletValue      uniform 0.767;
        value           uniform 0.767;
    }

    front
    {
        type            inletOutlet;
        inletValue      uniform 0.767;
        value           uniform 0.767;
    }

    back
    {
        type            inletOutlet;
        inletValue      uniform 0.767;
        value           uniform 0.767;
    }

    walls
    {
        type            zeroGradient;
    }

    source
    {
        type            fixedValue;
        value           uniform 0;
    }

    nozzle_wall_rest
    {
        type            zeroGradient;
    }
}
