case_up_half_cube_01_800_wave/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

walls.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       170;

    subsetFeatures
    {
        nonManifoldEdges no;
        openEdges        yes;
    }

    writeObj            yes;
}

nozzle_wall.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       170;

    subsetFeatures
    {
        nonManifoldEdges no;
        openEdges        yes;
    }

    writeObj            yes;
}

// ************************************************************************* //
